WF/src/InformationRegisters/ОкладыСотрудников/ОкладыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОкладыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WF/src/InformationRegisters/ОкладыСотрудников/ManagerModule.bsl
Функция ПолучитьОклад(СотрудникОтбора, ПериодОтбора) Экспорт
       Запрос = Новый Запрос();
	   Запрос.Текст = 
	   "ВЫБРАТЬ
	   |	ОкладыСотрудниковСрезПоследних.Оклад КАК Оклад
	   |ИЗ
	   |	РегистрСведений.ОкладыСотрудников.СрезПоследних(&ДатаОтбора, Сотрудник = &Сотрудник) КАК ОкладыСотрудниковСрезПоследних";
	   Запрос.УстановитьПараметр("ДатаОтбора", ПериодОтбора);
	   Запрос.УстановитьПараметр("Сотрудник", СотрудникОтбора);
	   РезультатЗапроса = Запрос.Выполнить();
	   Если РезультатЗапроса.Пустой() Тогда
		   ОкладСотрудника = 0;
	   Иначе
		   ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		   ВыборкаДетальныеЗаписи.Следующий();
		   ОкладСотрудника = ВыборкаДетальныеЗаписи.Оклад;
	   КонецЕсли;
	   Возврат ОкладСотрудника;
КонецФункции // ПолучитьОклад()
